nc: 80 
scales: 
  n: [0.50, 0.25, 1024]   


backbone:
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, shiyan9, [256, True, 2, 3]] 
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 4, shiyan9, [512, True, 2, 3]]
  - [-1, 1, DSConv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, shiyan9, [512, True, 2, 3]] # 6
  - [-1, 1, DSConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, shiyan9, [1024, True, 2, 3]] # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9

head:
  - [[4, 6, 9], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [10, 1, DownsampleConv, []]
  - [[6, 10], 1, FullPAD_Tunnel, []]  #13     
  - [[4, 11], 1, FullPAD_Tunnel, []]  #14    
  - [[9, 12], 1, FullPAD_Tunnel, []]  #15 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, shiyan9, [512, False, 2, 3]]  # 18
  - [[-1, 10], 1, FullPAD_Tunnel, []]  #19

  - [18, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 14], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, shiyan9, [256, False, 2, 3]] # 22
  - [11, 1, Conv, [256, 1, 1]]
  - [[22, 23], 1, FullPAD_Tunnel, []]  #24

  - [22, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat head P2
  - [-1, 2, DSC3k2, [128, True]] # 27

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 24], 1, Concat, [1]] # cat head P3
  - [-1, 2, shiyan9, [256, False, 2, 3]] # 30

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 19], 1, Concat, [1]] # cat head P4
  - [-1, 2, shiyan9, [512, False, 2, 3]] # 33
  - [[-1, 10], 1, FullPAD_Tunnel, []]  

  - [34, 1, Conv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P5
  - [-1, 2, shiyan9, [1024, False, 2, 3]] # 37 (P5/32-large)
  - [[-1, 12], 1, FullPAD_Tunnel, []]  
  
  - [[27, 30, 34, 38], 1, MEAcanchaFASFFHead, [nc]] # Detect(P3, P4, P5)