nc: 3
scales: 
  n: [0.50, 0.25, 1024]   
backbone:
  - [-1, 1, Conv,  [64, 3, 2]] 
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] 
  - [-1, 2, MCAFEM, [256, True, 2, 3]] 
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] 
  - [-1, 4, MCAFEM, [512, True, 2, 3]]
  - [-1, 1, DSConv,  [512, 3, 2]] 
  - [-1, 4, MCAFEM, [512, True, 2, 3]] 
  - [-1, 1, DSConv, [1024, 3, 2]]  
  - [-1, 2, MCAFEM, [1024, True, 2, 3]] 
  - [-1, 1, SPPF, [1024, 5]]  
head:
  - [[4, 6, 9], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [10, 1, DownsampleConv, []]
  - [[6, 10], 1, FullPAD_Tunnel, []]      
  - [[4, 11], 1, FullPAD_Tunnel, []]    
  - [[9, 12], 1, FullPAD_Tunnel, []]  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 2, MCAFEM, [512, False, 2, 3]]  
  - [[-1, 10], 1, FullPAD_Tunnel, []]  
  - [18, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 14], 1, Concat, [1]] 
  - [-1, 2, MCAFEM, [256, False, 2, 3]] 
  - [11, 1, Conv, [256, 1, 1]]
  - [[22, 23], 1, FullPAD_Tunnel, []]  
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] 
  - [-1, 2, DSC3k2, [128, True]] 
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 24], 1, Concat, [1]] 
  - [-1, 2, MCAFEM, [256, False, 2, 3]] 
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 19], 1, Concat, [1]] 
  - [-1, 2, MCAFEM, [512, False, 2, 3]] 
  - [[-1, 10], 1, FullPAD_Tunnel, []]  
  - [34, 1, Conv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] 
  - [-1, 2, MCAFEM, [1024, False, 2, 3]] 
  - [[-1, 12], 1, FullPAD_Tunnel, []]  
  - [[27, 30, 34, 38], 1, MASEM_Head, [nc]] 